{"pageProps":{"note":{"title":"Laravel Vapor","content":"- [Serverless Laravel Course](https://serverlesslaravelcourse.com/)\r\n- [[laravel]]\r\n\r\n[Laravel Vapor](https://vapor.laravel.com/) is a [[serverless]] deployment solution for Laravel, built on AWS. It simplifies orchestrating microservices such as the database server, CDN, PHP web application, queue processing, email sending, caching, etc. as well as the logging, provisioning and monitoring the applications. Yes, you could build all of this yourself with AWS, but that would require a lot more code then the 1 Vapor YML file and a ton more work. And then you'd have to maintain it.\r\n\r\nI've used Vapor for internal applications at Saturday Drive. With a little bit of experimentation and a lot of things I learned from the [Serverless Laravel Course](https://serverlesslaravelcourse.com/), we were able to create a highly scalbabe application with minimal cost or worry.\r\n\r\n## Database\r\n\r\nFind this sticky note.\r\n\r\n- Serverless vs Fixed\r\n  - Aurora takes too long to scale up for many app types.\r\n    - Minumuma capactity with automatic scaling is an advantage of serverless.\r\n    - Will not pay most of the time for staging database, beacuse its paused.\r\n    - Cost is complex and can be real expensive.\r\n    - Requires a VPC.\r\n    - Self-healing and more throughput.\r\n  - Over-provisioning a RDS is fixed cost, still managed.\r\n    - Probably over-paying, but predictable cost.\r\n    - Risk is high traffic breaking DB\r\n      - Limit queue concurrency.\r\n      - Add Redis cache level.\r\n    - You can set the scaling of storage in AWS console to auto.\r\n- Scaling/ Failover\r\n  - A failover database comes online if production db goes down.\r\n    - Failover takes ~60 or more.\r\n    - Failover DB is recommend, doubles database cost.\r\n    - Also allows for zero downtime db Scaling.\r\n      - Vapor will bring failover up, scale up primary, switch back to primary, then scale up failover.\r\n\r\n## Queues\r\n\r\n- With standard queue, can not assume order. Can not assume that job will only run once.\r\n- Assume SQS is down, to prevent loosing jobs. Always use retry.\r\n  - https://laravel.com/docs/8.x/helpers#method-retry\r\n- Queues run in there [own Lamda](https://blog.laravel.com/vapor-using-a-separate-lambda-function-for-queues).\r\n  - Use `queue-memory` to set the RAM.\r\n\r\n### Retry Laravel Job\r\n\r\n- https://serverlesslaravelcourse.com/video/27\r\n\r\n```php\r\n      return retry(20, function () {\r\n          dispatch( new SomeJob( ) );\r\n      }, 200 );\r\n```\r\n\r\n### Ensuring A Job Only Runs Once\r\n\r\n- https://serverlesslaravelcourse.com/video/28\r\n- Set a queue timeout. Something a little longer then longest jobs.\r\n- Default timeout is 70s, so then it runs again. Potential loop.\r\n- Job timing out is fine, job running multiple times is not.\r\n- Always check database is onlin.\r\n\r\n## Other\r\n\r\n- \"warn\" - avoid 2s post-deploy delay.\r\n  - Bring X containers online before deployment and rewarmed every 5 minutes.\r\n  - Warming, not too expensive. Polling warms for 40 containers would be ~\\$1.\r\n- Vapor \"secrets\" are for big environment variables. Acccesed using the `env()` helper function.\r\n  - Environment variables can be seen in plain text in vapor UI. Secrets can not.\r\n\r\n## Concurrency\r\n\r\nConcurrency is how many Lamdas can exist at once. Each web requests gets one of Lamdas, with the memory set.\r\n\r\n- https://blog.laravel.com/vapor-using-a-separate-lambda-function-for-queues\r\n- Three Lamdas: web requests,cli,queue.\r\n  - Each has `*-concurrency`, `*-memory`, `*-timeout`\r\n  - Adding `*-memory` ads more processing\r\n- Warming can slow requests happening during warming. Concurrency keeps X containers always online.\r\n  - Could mean paying to keep things online all the, or could avoid paying for warming. Can save a lot of money, if enough consitent traffic.\r\n  - By default 1000 is default Lamda concurrency.\r\n    - Limit cuncurrency in Vapor to limit costs.\r\n    - AWS has built in protections.\r\n\r\n","slug":"laravel-vapor","references":[{"slug":"laravel","url":"/notes/laravel"}]},"slug":"laravel-vapor"},"__N_SSG":true}