{"pageProps":{"note":{"title":"High Voltage Living","content":"**These are notes from \"High Voltage Living\" [interintellect](https://www.interintellect.com/Salon) on 14 August, 2020 led by [Visa](https://twitter.com/visakanv).** The words here are paraphred from what Visa said, copied from the chat or my own reactions.\r\n\r\nHow to increase your volatage?\r\n\r\nHow to create Voltage internally, not relying on external environment.\r\n\r\n## TL;DR\r\n\r\n### Conculsions\r\n\r\n- Take twenty minutes a day to bootstrap your best life.\r\n- Play with the joke that existance is playing with us.\r\n- Optimize for excitement.\r\n  - Happiness is contextual, you can't be be happy all the time. Trying to behappy all the time prevents growth.\r\n  - Be navigated by what is exciting.\r\n  - Feelings and emotions are best understood socially.\r\n\r\n### Key Notes\r\n\r\n- Your body is a set of connected springs.\r\n- Hyper-empathy becomes apathy as a coping mechanism.\r\n- Takes constant awareness to push out of comfort zone and increasing the voltage.\r\n- There are friends and there are serious friends.\r\n- What does it mean to be sensative?\r\n  - Sensitivity is about bringing in inputs.\r\n  - Smarts is about processing\r\n  - Strength is the ability to execute on what you have processed.\r\n- You will suffer for a time, not being able to move as fast as others, not learning how others learn.\r\n  - Harness this by learning basic principles of relationships and find the patterns in all things.\r\n- Mystery solving is where the magic is.\r\n- **I want to go on a walking vacation**.\r\n  Build associations with a topic by thinking about someone I know, who cares about the topic.\r\n- Say \"should\" not as a command: it is an invitation.\r\n\r\n## Observations From Intros\r\n\r\n\"Like is more boring then it used to be, how to make it intresting again?\"\r\n\r\nHyper-empathy becomes apathy as a coping mechanism.\r\n\r\nHigh voltage is different in your 20s then 30s, etc.\r\n\r\n\" I like to support people! This is helpful – 6 years ago writing open source software, meeting people around the world, started a company. Burnout from the other side of excitement. Sold the co, work for another, more chill spot now, what’s next. How do I do that with more intent and self-care in the future? What is that? What does it mean?\"\r\n\r\n\"Colours and magic\"\r\n\r\n\"Learned to use masks as a tool to navigate the world. Discovering that these masks have take over me, so that I’m not aware what’s the real me anymore.\"\r\n\r\n\"Takes constant awareness to push out of comfort zone and increasing the voltage.\"\r\n\r\n## Emotions And Developing Limits\r\n\r\nCan be dangerous if too high voltage. Love Hendrix, very high energy and bright colors, but he died early. If emotional energy is coming from repressed emotions, unresolved emotions, unaddressed issues, it can lead to high productivity, but also high burnout risk.\r\n\r\nGetting burned out when earlier was good, beacuse he learned what the limit is. Now can be more sensative. Has to have friends to talk to. To develop Always be talking to a diverse range of peers -- spouse and friends, but also others, perspective from those you don't see often can help you not go too mad.\r\n\r\nThere are friends and there are serious friends.\r\n\r\nWhat does it mean to be sensative? Sensitivity is about bringing in inputs, smarts is about processing, and strength is the ability to execute on what you have processed. There are strength and smart cults, people who want to fight or debate, they worship strength or smarts. No one workships sensitivity?\r\n\r\nSensitivity is very powerful, easily burned out by mishandling inputs. Sensitivity is first thing that goes out the window in a cohersive environment -- in schools they tell you what to look at, not what you want. Men told to look at the data, it's perceptive, but also leads to under valuing emotions. We choose to be \"thinking guy\" to avoid \"feeling first\", not be too dramatic.\r\n\r\nYou want to be high voltage in yourself, but not burn others in the process. Need to give other people space.\r\n\r\nCongrence: Having the self-esteem to act in the way demanded by the situation. Appearing on the outside the same way you feel inside.\r\n\r\n## Resistance\r\n\r\nFeeling resistance to getting work done is hard. Could push, watch motivational videos, etc.\r\n\r\nInspect element on resistance.\r\n\r\nChallenge is to ask with curiosity and ask self, \"what's up? You said you wanted to do X, why are you not doing it?\" Answer honestly. Often times the parts of the process are not explicit, or it's too big. Why am I in agony about not doing the thing I want to do and know I can do?\r\n\r\n'hitting inspect element on the resistance' - love this phrase!\r\n\r\nThe book The War of Art is required reading. Has pages on resistance to doing your best work. Has a fascinating way of personifying resistance and presenting it as a kind of archetypal force. Personification to bring abstract problems into more intuitive realm.\r\n\r\nYou can choose an object in your house, and with siencrity and give it special value and purpose, if you belive in it.\r\n\r\nA friend at work says her internal monologue is like something (her brain?) pulling words from a big cloud, not a voice.\r\n\r\nCreate more and more notes of light in the brain graph for later and to share. [Example, collect and bank motivational videos for later](https://twitter.com/visakanv/status/1084014654156754945) Create virtuous cycle, like a video game cheat.\r\n\r\nhttps://medium.com/@josephparrish/the-rise-of-meaningwave-music-794139f2d3fe\r\n\r\n## Harnessing ADD and ADHD\r\n\r\nWasn't child running around, running around is in my head. Was late to understand that as ADD. Was a bad student, not beacuse bad at learning, but beacuse wanted to learn at his own pace.\r\n\r\nUnderstanding of brain is very new, expect definition of ADD and neurodiversity to change over time.\r\n\r\nYou will suffer for a time, not being able to move as fast as others, not learning how others learn. But can harness by learning basic principles of relationships and find the patterns in all things. How to tie things toghether. Too often we teach in abstract. It's better to learn in terms of relationships.\r\n\r\nBuild associations with a topic by thinking about someone I know, who cares about the topic.\r\n\r\nThis is an incredible essay on that same trend in math education (but I find it applies to so many different subjects). Just the first three pages are beautiful [https://www.maa.org/external_archive/devlin/LockhartsLament.pdf](https://www.maa.org/external_archive/devlin/LockhartsLament.pdf)\r\n\r\n[AssociatIve](http://webseitz.fluxent.com/wiki/AssociatIve)\r\n\r\nMystery solving is where the magic is.\r\n\r\nDon't worry about being perfect. Don't have to use the new language you're learning 100% of the time, right away. Be more playful, fill the gaps with the language you already know.\r\n\r\nDoes boxed building/ slow breathing first thing in AM, for two to three minutes, instead of meditiation, first to address nightmares. Found that it reduced the amount of time to become awake in morning.\r\n\r\nYour body is a set of connected springs.\r\n\r\n## Calibration For Consitiency\r\n\r\nYou hardly ever get to start out doing what you love. **I want to go on a walking vacation**.\r\n\r\nCycles are natural. When you're sad be sad. Be pyalful with your spirtuality, existance is hilarious.\r\n\r\nSprituality: A surrender to a sense to something greater then yourself within you. Sometimes we come toghether to celebrate this thing we're all a part of.\r\n\r\nToo often we mistake the map for the territory. Easy to fall into a trap where everything you've seen and heard is everything there is. Reality is more hetrogenous than we would like. When COVID is over, you can walk out of your house and walk futher then you have ever been and see something you have not seen.\r\n\r\nSay \"should\" not as a command: it is an invitation.\r\n\r\nDon't think everything on Earth is already discovered. You can always explore your feelings and depths of self consiouss. Below the conscious dwelling, are weird things below. Normal life is the mainstream sect of magic.\r\n\r\nhttp://webseitz.fluxent.com/wiki/SocialFiction\r\n\r\nIt's hard to care about health in the abstract. But in context, do things to allow you to do something, and that unlocks experience. Need to stay hydrated for recording videos, leads to other health effects.\r\n\r\n- Take twenty minutes a day to bootstrap your best life.\r\n- Play with the joke that existance is playing with us.\r\n- Optimize for excitement.\r\n  - Happiness is contextual, you can't be be happy all the time. Trying to behappy all the time prevents growth.\r\n  - Be navigated by what is exciting.\r\n  - Feelings and emotions are best understood socially.\r\n","slug":"ii-1-high-voltage-living","references":[]},"slug":"ii-1-high-voltage-living"},"__N_SSG":true}