{"pageProps":{"note":{"title":"Meadow","content":"Networked second mind(s) app.\r\n\r\n## Why\r\n\r\nWhen I share my words about something on a social media platform, on a tool I use at work, they are still my words. Also, they are the creation of so many people and systems that are beyond me. When I see people saying web3 should allow us to own the product of our own labor, I agree. I don't think this means monetizing ourseleves at a Fortnite-like level, as I don't want to optimize myself for the kind of engagment that leads to whatever the tokenized version of lots of in-app purchases. But I do want what I learn about what I do for a living and other things I enjoy thingking about, resarching an practicing to be accesible to me and others, especially those who contributed to my understanding of the subject.\r\n\r\n## Main Features For v1\r\n\r\nA \"~\" indicates a \"must have\" in the [ShapeUp](https://basecamp.com/shapeup) methodology\r\n\r\n\r\n- ~ Clippings: Link sharing with support for native share api.\r\n- Leaves: Private written notes with embeded clippings.\r\n  - Probably not needed.\r\n- ~ Bubbles: Git-backed [foam bubbles](https://foambubble.github.io/)\r\n  - Editor with clipping embeded.\r\n- Graph of relationship between all content.\r\n\r\n### Other Early Ideas\r\n\r\n- Replace PWA with Electron app.\r\n- [[wordpress]] plugin that makes clippings and bubbles reusable blocks.\r\n\r\n## API Server\r\n\r\n> [Source](https://github.com/shelob9/meadow)\r\n>\r\n> [URL](https://meadow.joshpress.net)\r\n\r\n### Overview\r\n\r\n- [[laravel]]\r\n- Deployed on [Render](https://render.com)\r\n- VueJS front-end (Not needed, will go away)\r\n\r\nAfter trying for awhile to over-engieer this app using Node on the backend, I decided to simplify things. I am using Laravel for CRUD, REST API and authentication.\r\n\r\nLaravel and VueJS also gave me a fast way to prototype UI, and think about how this app could work.\r\n\r\nCurrently what is deployed is an API for two data types and that basic UI. The app is installable -- I used Laravel PWA and a custom [[service-workers]] I wrote. The service worker does provide basic caching, but it's primary purpose is native share withe share API.\r\n\r\n## Halloween\r\n\r\nFirst useful front-end client for meadow.\r\n\r\n> See: [[meadow-halloween]]\r\n\r\n## Foam\r\n\r\n> [Source](https://github.com/shelob9/meadow-foam)\r\n>\r\n> [URL](shelob9.github.io/meadow-foam/)\r\n\r\nThis site, for now. [[foam-site]]\r\n\r\nCould add clippings, leaves, etc of meadow to the [foam graph](https://github.com/foambubble/foam/blob/master/packages/foam-core/src/note-graph.ts) and add interlinking.\r\n\r\nSecond Brain + Link clipping app is a nice MVP for meadow, right? Does that rule even apply here?\r\n\r\n## Link Share/ Clippings With Quotebacks (MVP) + Clippings Plug-in For Gutenberg (MVP+1)\r\n\r\nUse existing meadow app for clipping share. Maybe keep levaes as small private notes. Link shares shown publicly with quote backs.js\r\n\r\nCreate WordPress plug-in/lib for quotebacks.js\r\n\r\nCreate clippings WordPress plug-in that makes all clippings into reusable blocks, rendered with quotebacks.js\r\n\r\n## Incremintal Path\r\n\r\n- [[meadow-birddog.md]]\r\n- Clipper\r\n- Minimal Foam/Roam/WordPress integration\r\n- Social game\r\n- Meadow Garden\r\n","slug":"meadow","references":[{"slug":"meadow-halloween","url":"/notes/meadow-halloween"}]},"slug":"meadow"},"__N_SSG":true}