{"pageProps":{"note":{"title":"Digital Gardens","content":"# Digital Gardens\n\n>My goal is: \"I want to produce novel, powerful ideas.\" A computer-supported thinking system is helpful insofar as it supports that. But it's hard to evaluate those systems empirically because such ideas are rare. People who blog about note-taking systems don't produce them.\n> [Andy Matuschak @andy_matuschak on Twitter](https://twitter.com/andy_matuschak/status/1247604704013512705?s=09)\n\nA digital garden is a public notebook you can use to grow your ideas from a seed to a full grown essay. \n\n## What Is A Digital Garden?\n\n> The term “digital garden” is not well-defined. In general, it is a collection of thoughts, unfinished projects, links, and much more. However, it can be different and wholly unique to the individual. I would like to broaden the term to enclose any sort of website that allows you to truly browse without viewing posts chronologically. Digital gardens, collections, spaces — call it what you want.\n>  [On Digital Gardens, Blogs, Personal Spaces, and the Future](https://wptavern.com/on-digital-gardens-blogs-personal-spaces-and-the-future)\n\n[Maggie Appleton](https://maggieappleton.com/) describes [her digital garden](https://maggieappleton.com/garden/) as an \"An open collection of notes, resources, sketches, and explorations I'm currently cultivating. Some notes are Seedlings, some are budding, and some are fully grown Evergreen.\" \n\nIn [Evergreen Notes](https://notes.andymatuschak.org/z4SDCZQeRo4xFEQ8H4qrSqd68ucpgE6LU155C), Andy Matuschak writes: \"Evergreen notes are written and organized to evolve, contribute, and accumulate over time, across projects.\" In that note he suggests a process based on the Zettelkasten method.\n\n## The Zettelkasten Method\n\nZettelkasten is a formal method of note taking for research. Many of those strategies are applicable to digital gardening. The following are some principles and advice, collected from [Zettelkasten.de](https://zettelkasten.de/), which is a recommended read.\n\nThe Zettelkasten method, originated by social scientist Niklas Luhmann promises these benefits:\n```\n1. We can improve the connectivity of our thoughts.\n\n2. We can be more productive.\n3. We stop wasting our efforts.\n4. We can tackle more complex problems.\n5. Normal note-taking will create a bloated mess over time. \n6. The Zettelkasten Method will make your writing easier, more coherent, smoother and more convincing. \n```\n\n[See: Intorduction to Zettelkasten](https://zettelkasten.de/introduction/)\n\nThere are two important principles to keep in mind, that will help a digital garden grow. First, [the principle of Atomicity](https://zettelkasten.de/posts/create-zettel-from-reading-notes/). Create one note for one topic, put everything related to that topic and nothing else in that note. Each [note should be atomic](https://notes.andymatuschak.org/z4Rrmh17vMBbauEGnFPTZSK3UmdsGExLRfZz1). \n\nThe second principle is the [Principle of Connectivity](https://zettelkasten.de/posts/luhmann-folgezettel-truth/) -- create and highlight links between notes. Your notes [should be linked](https://notes.andymatuschak.org/z2HUE4ABbQjUNjrNemvkTCsLa1LPDRuwh1tXC).\n \n The digital garden builder allows you to create notes and [visualize the connections between them](https://github.com/Shelob9/digitial-garden-builder/issues/9). You can use \"wiki-style\" double bracket links to link between notes.\n","slug":"digital-gardens","references":[]},"slug":"digital-gardens"},"__N_SSG":true}