{"pageProps":{"note":{"title":"Git CMS","content":"[Digital Garden Builder](https://docs.digitalgardenbuilder.app/) was partially developed as proof of concept for Git CMS. My hope is that others will be able to create there own front-ends for this API. I intend to make it especially useful to those creating mutli-author applications with markdown and block-based content and APIs.\r\n\r\nThis note is about why I am building GitCMS and what my plans are. The [Readme](https://github.com/Shelob9/gitcms/blob/main/README.md) has notes about how it works. If you would like to help with this project, please open an [issue](https://github.com/Shelob9/gitcms/issues) or send me [DM on Twitter](https://twitter.com/josh412).\r\n\r\n## Why Git?\r\n\r\nContent creation is mutliplayer and takes place over an extended period of time. This has always been true, but the internet makes this more true. Git and other version controll systems are purpose built for distributed, multi-author content creation. By using Git, and Github's API and get versioned, branchable, forkable, multi-author data storage with little to no cost for data storage and website hosting.\r\n\r\nWhile traditional CMSes seperate content from code by storing content in a database, many [Jamstack sites](https://jamstack.org/what-is-jamstack/) store there content in the same git repo as the code. While this creates a host of UX and DX issues, it means the content __can be__ versioned with transperancy about what has changed, when and by whom. It can also be multi-author and the storage can be distributed.\r\n\r\nRight now, I am using the [github-api] beacuse Github makes so much of the complexity of building this trivial. Also, they provide free data storage and hosting as well as handle authentication. Long-term, I would rather this used a a trustless, p2p system for data storage and the commit hashes were logged on a blockchain of some sort.\r\n\r\n## Content Types\r\n\r\nGitCMS works with directories of markdown or JSON files. Markdown is parsed to HTML or other formats using [mdx](https://mdxjs.com), which is commonly used with [Gatsby](https://www.gatsbyjs.com/) and allows for processing text with [unified.js](https://unifiedjs.com/).\r\n\r\n## Roadmap\r\n\r\n- v0 Proof of concept built into Digital Garden Builder\r\n- v1 npm package abstracted from Digital Garden Builder\r\n  - Uses Github API for authentication and storage\r\n  - Markdown and JSON files and API endpoints.\r\n  - Graph of links between notes\r\n  - Graph of conceptual links between notes\r\n  - Stretch goals:\r\n    - Edge cache\r\n    - GraphQL server\r\n    - WordPress plugin to import blocks and notes into posts and pages.\r\n    - Sync notes to [dev.to](https://dev.to) and other [Forem](https://www.forem.com/) communities.\r\n- v2 Decentralized storage and identity\r\n  - Use a distributed identity token and/ or 3Box and/or ENS for identity.\r\n  - Decentralized git provider or use something like [isomorphic git](https://github.com/isomorphic-git/isomorphic-git) with [ipfs](https://ipfs.io/) for storage.[]\r\n","slug":"gitcms","references":[]},"slug":"gitcms"},"__N_SSG":true}