{"pageProps":{"note":{"title":"Meadow (Halloween)","content":"I am working on networked-mind tool called [[meadow]] at a very leisurly pace. My goal is to build a collaborative publishing tool. My first step is to build something that can display my blog posts, which are all on different sites, my clippings, my notes, as well as content from social media. I called the step \"Halloween\" beacuse I love the song Halloween by Mastodon. Also, I wish there was more times of the year where we reminded ourselves that we can be whoever we want to be.\r\n\r\n## Content Types\r\n\r\n### Clippings\r\n\r\nThese are quotes and hyperlinks I gathered using the Meadow PWA. This content is currently stored in a MySQL database. I used [[Laravel]] to build a REST API for clippings. The Laravel app also serves a basic PWA. This allows me use the native \"Share\" feature on my phone to add clippings.\r\n\r\n### Posts\r\n\r\nThese are blog posts I have written on dev.to and on various WordPress sites. The WordPress posts are pulled into the site using The WordPress REST API.\r\n\r\n### Bubbles\r\n\r\nThese are in progress notes. I write these using VSCode using [Foam](https://foambubble.github.io/foam/) a personal knowledge management and sharing system inspired by [Roam Research](https://roamresearch.com/). I built a [[markdown-api]] to get the content from Github, into this site.\r\n\r\n## How Halloween Works\r\n\r\n> [Source](https://github.com/shelob9/meadow-halloween)\r\n>\r\n> [URL](https://garden.joshpress.net).\r\n\r\nHalloween uses [[next]] for the front-end client and additional API routes. I used [[tailwind]] css. There is a login page that allows login using Githun -- it only works if you authenticate as me, for now. The auth system was built using the most excellent [Next Auth](https://github.com/nextauthjs/next-auth).\r\n\r\n## Next Steps\r\n\r\n- Simplify and standardize UI\r\n- Embeded Bubble editor\r\n  - Markdown\r\n  - Run Foam janitor on bubbles -- in API before save or Github action after commit?\r\n  - Bubble graph.\r\n  - Content PR submissions\r\n  - Contributor visualization\r\n- Graph of relationships between contents.\r\n- For logged in user, Twitter timeline and favorites with clip button\r\n- Button to create a PR to edit a bubble.\r\n- Button to fork a bubble into your own bubble.\r\n","slug":"meadow-halloween","references":[{"slug":"meadow","url":"/notes/meadow"}]},"slug":"meadow-halloween"},"__N_SSG":true}