{"pageProps":{"note":{"title":"Newsletter","content":"Josh's email newsletter.\r\n\r\nGoal is post status meets @visakanv meets David Lynch's YouTube channel\r\n\r\n## Problem Space\r\n\r\n### Use My Accumulated Status To Grow Audience In A Slightly Different Direction\r\n\r\n> [https://twitter.com/visakanv/status/1287418281154867201?s=19](https://twitter.com/visakanv/status/1287418281154867201?s=19)\r\n\r\nI'm known for building WordPress plug-ins, teaching about it and having opinions on the quality, security and ethics of it\r\n Also saying hi to Roy.\r\n\r\n> [https://twitter.com/Josh412/status/1286707295687254016?s=19](https://twitter.com/Josh412/status/1286707295687254016?s=19)\r\n\r\nWhat's interesting to me is building things I can't build, preferably collaboration software. I've been trying to figure out how to do that for awhile. I'm getting way better, but I became known for adjacent skills that have more monetary value but are not the thing.  I want to be known for building collaboration tools. Not better typewriters -- can't beat Google Docs -- typewriters are for two sets of hands\r\n\r\n. I want to build things that are centred on the idea that we don't create as individuals, but as a collectivei don't know how to do that, but it's what I've been after since I got into this. Not knowing how to do it is fun and we'll figure it out.\r\n\r\n### Imaginary Coins\r\n\r\nThe email list is not bey set up so I can sell people stuff something next week. It is going to mention a lot of things that Saturday Drive sells and my friends sell and cool shit I might buy. But right now, I have no plans to sell you a course or ebook. I thought about it, but I have a good job, I'd rather write in the open and build more of a following now. That's more fun and more worth it to me then more money then I need.\r\n\r\nAlso, I have a valueless, personally branded digital currency to play with for fun.  Seriously. I like the idea of having an email list that is sort of about crypto, and I keep making jokes about my PretendCoin.\r\n\r\n## Beta Testing Period\r\n\r\nI would like to have a small beta testing group that recives the first 3-6 newsletters. That way I feel like I'm writing to someone and there are stakes, but it's less scary. I'd like to get some feedback on what I am trying to do from people who know me and would be willing to pay a more someone who is better at this then me to give some critical feedback.\r\n\r\n## Outline\r\n\r\n### Is Yield Farming A Scam? The old world was bad anway\r\n\r\n- Texts from dad on email marketting.\r\n- Remaking the old world is boring, make something else.\r\n- Yield farming, what is it and arn't banks scams anyway?\r\n- Developing blocks and React apps toghether\r\n\r\n### GTP-3 and AI. What is life? What is work?\r\n\r\n- GTP-3 what is it and what can it do?\r\n- Schrödinger's \"What Is Life?\"\r\n- Would my job be cool with me programming an AI to program there programs?\r\n- @JoshRoyBot765 - Why be one person?\r\n  \r\n### Distributed Identity: Who are you?\r\n\r\n- Distributed identity tokens.\r\n- Is magic.link solving crypto's UX problem?\r\n- Can WordPress be a trusted source of identity?\r\n\r\n## Optimism and Puppies. MACY!\r\n\r\n- Optimism when the world is ending.\r\n- Climate change, asension and imortality.\r\n- Puppies.\r\n- Music and software.\r\n","slug":"newsletter","references":[]},"slug":"newsletter"},"__N_SSG":true}